app/controllers/nodes_controller.rb

  def index
    if(current_user.admin?)
     @search = Node.search(params[:search])
     @nodes = @search.group("id").page(params[:page]).per_page(15)
---
SELECT `nodes`.* FROM `nodes` WHERE (`nodes`.user_id = 2)
SELECT COUNT(*) AS count_all, id AS id FROM `nodes` GROUP BY id
SELECT `nodes`.* FROM `nodes` GROUP BY id LIMIT 15 OFFSET 0

  def create
    @node = Node.new(params[:node])
    @node.user = current_user
    respond_to do |format|
      if @node.save
---
INSERT INTO `nodes` (`name`, `path`, `category`, `zoom`, `center`, `user_id`, `created_at`, `updated_at`) VALUES ('n1', 'o`~zDo|ckDmwAs}gA|vq@tjD?|xeA', 'n1', NULL, NULL, NULL, '2012-05-09 23:17:11', '2012-05-09 23:17:11')

  def edit
    @node = Node.find(params[:id])
---
SELECT `nodes`.* FROM `nodes` WHERE `nodes`.`id` = 2 LIMIT 1

  def update
    @node = Node.find(params[:id])
    authorize_node(@node)
    category_before = @node.category
    respond_to do |format|
      if(@node.update_attributes(params[:node]))
---
SELECT `nodes`.* FROM `nodes` WHERE `nodes`.`id` = 7 LIMIT 1
UPDATE `nodes` SET `path` = '{p}aEohuoDvnm@xnyChtg@jgqB`foAwcrAvaOsvdAjgM}oUrf_@q|dBvoP}|x@ksf@irViyn@ig`@wbj@tqGmfRkdPohQ}hRqnDslq@cmd@|p_BaoNpytA', `updated_at` = '2012-06-18 08:01:17' WHERE `nodes`.`id` = 7

  def destroy
    node = Node.find(params[:id])
    if(request.xhr?)
      if(current_user == node.user)
        node_src_routes = node.src_routes
        node_dest_routes = node.dest_routes
        if(node_src_routes.empty? && node_dest_routes.empty?)
          @id = node.id
          node.destroy
---
SELECT `nodes`.* FROM `nodes` WHERE `nodes`.`id` = 7 LIMIT 1
SELECT COUNT(*) FROM `sub_routes` WHERE (`sub_routes`.dest_id = 7)
SELECT `sub_routes`.* FROM `sub_routes` WHERE (`sub_routes`.dest_id = 1)
DELETE FROM `nodes` WHERE `nodes`.`id` = 7

  def confirm_deletion
    @routes = []
    @routes_ids = params[:routes_ids]
    @node_id = params[:node_id]
    @routes_ids.each do |id|
      @routes.push(Route.find(id))
---
SELECT `sub_routes`.* FROM `sub_routes` WHERE (`sub_routes`.route_id = 4)

  def deletion_confirmed
    routes_ids = params[:routes_ids]
    node_id = params[:node_id]
    routes_ids.each do |id|
      route = Route.find(id)
      notify_route(route, "deleted")
      route.destroy
    end
    node = Node.find(node_id)
    notify_node(node, "deleted")        # adds notification for deletion
    Node.destroy(node_id)
---
SELECT `sub_routes`.* FROM `sub_routes` WHERE (`sub_routes`.route_id = 2)
DELETE FROM `sub_routes` WHERE `sub_routes`.`id` = 2
SELECT `nodes`.* FROM `nodes` WHERE `nodes`.`id` = 6 LIMIT 1
DELETE FROM `nodes` WHERE `nodes`.`id` = 6

  def districts
    @names = Node.where("name like ?", "%#{params[:term]}%").limit(5).map(&:name)
---
SELECT `nodes`.* FROM `nodes` WHERE (name like '%s%') LIMIT 5