app/controllers/routes_controller.rb

  def show
    @route = Route.find(params[:id])
---
SELECT `sub_routes`.* FROM `sub_routes` WHERE (`sub_routes`.route_id = 5)

  def index
   if current_user.admin?
     @search = Route.search(params[:search])
     @routes = @search.group("id").page(params[:page]).per_page(15)
---
SELECT `routes`.* FROM `routes` WHERE (`routes`.user_id = 2)
SELECT COUNT(*) AS count_all, id AS id FROM `routes` GROUP BY id

          created_stops.push(dest_stop)
          created_districts.push (dest)
        else
          dest = Node.find(dest_id)
---
SELECT `nodes`.* FROM `nodes` WHERE `nodes`.`id` = 42 LIMIT 1

            dest_stop = Stop.find(dest_stop_id)
          end
          created_stops.push(dest_stop)
          notified_nodes.push(dest) if (dest.user != current_user)
---
INSERT INTO `nodes` (`name`, `path`, `category`, `zoom`, `center`, `user_id`, `created_at`, `updated_at`, `id`) VALUES ('11', 'kmmzD_cbaE|tNg|i@tn]zi|Aosg@sjD', '55', NULL, NULL, NULL, '2012-06-16 19:01:17', '2012-06-16 19:01:17', NULL)

        children[i].src = children[i-1].dest
        if(children[i].src.id.nil? || children[i].dest.id.nil?)
          children[i].save
          mappings.push(Mapping.new(:route => @route, :sub_route => children[i], :duration => children[i].duration))
---
INSERT INTO `routes` (`cost`, `transportation_id`, `user_id`, `created_at`, `updated_at`, `trans_category`, `trans_description`) VALUES (1, NULL, 1, '2012-06-29 12:51:48', '2012-06-29 12:51:48', 'Train', '')

      @route.mappings = mappings
      @route.user = current_user
      respond_to do |format|
        if @route.save
---
UPDATE `sub_routes` SET `route_id` = 4, `updated_at` = '2012-05-10 00:04:38' WHERE `sub_routes`.`id` = 5

  def edit
    @route = Route.find(params[:id])
---
SELECT `sub_routes`.* FROM `sub_routes` WHERE (`sub_routes`.route_id = 1)

  def update
    @route = Route.find(params[:id])
    authorize_route(@route)
    numOfStops = 0
    notified_nodes = []
    children = []
    children_params = params[:route]["sub_routes_attributes"]
    keys = children_params.keys
    keys.collect! {|i| i.to_f}
    keys.sort!
    keys.collect! do |i|
       if i == i.to_i
         i.to_i.to_s
       else
         i.to_s
       end
    end
    destroyed_mappings  = []
    for i in 0..keys.length-1
      child_params = children_params[keys[i]]
      child_id = child_params["id"]
      dest_params = child_params["dest_attributes"]
      dest_id = dest_params["id"]
      if child_params["_destroy"] == "1"
        destroyed_mappings.push(@route.getMapping(child_id.to_i)) if child_id != ""
---
SELECT `sub_routes`.* FROM `sub_routes` WHERE `sub_routes`.`id` = 6 LIMIT 1
UPDATE `sub_routes` SET `duration` = 10, `src_id` = 7, `updated_at` = '2012-06-27 22:55:10' WHERE `sub_routes`.`id` = 4

          dest.category = "District"
          dest.user = current_user
        else
          dest = Node.find(dest_id)
          notified_nodes.push(dest) if (dest.user != current_user && !@route.nodes.include?(dest))
---
SELECT `nodes`.* FROM `nodes` WHERE `nodes`.`id` = 4 LIMIT 1
SELECT `nodes`.* FROM `nodes` INNER JOIN `sub_routes` ON `nodes`.id = `sub_routes`.dest_id WHERE ((`sub_routes`.route_id = 5))
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

      destroyed_mappings.each do |mapping|
        mapping.destroy
      end
      params[:route].delete("sub_routes_attributes")
---
DELETE FROM `sub_routes` WHERE `sub_routes`.`id` = 6

        children[i].src = children[i-1].dest
        if(children[i].src.id.nil? || children[i].dest.id.nil?)
          children[i].save
          mappings.push(Mapping.new(:route => @route, :sub_route => children[i], :duration => children[i].duration))
---
INSERT INTO `sub_routes` (`src_id`, `dest_id`, `duration`, `route_id`, `created_at`, `updated_at`, `id`) VALUES (9, 2, 10, NULL, '2012-06-18 08:41:07', '2012-06-18 08:41:07', NULL)

  def destroy
    route = Route.find(params[:id])
    if(current_user.admin?)
      notify_route(route, "deleted")
      route.destroy
---
SELECT `sub_routes`.* FROM `sub_routes` WHERE (`sub_routes`.route_id = 5)
DELETE FROM `sub_routes` WHERE `sub_routes`.`id` = 7

  def search
    if(params[:src] != nil or params[:dest] != nil)
      n = Node.new
      if(params[:src] != "" and params[:dest] != "")
          @src = get_poi_destricts(Node.where(:name => params[:src]))
---
SELECT `nodes`.* FROM `nodes` WHERE `nodes`.`name` = 'district A'

  def data
    if params[:commit]
      if params[:commit] == ">"
        @nodes = Node.offset(params[:next].to_i).first(10)
        if @nodes.length == 0
---
SELECT `nodes`.* FROM `nodes`
SELECT `nodes`.* FROM `nodes` LIMIT 18446744073709551615 OFFSET 10