app/controllers/users_controller.rb

  def index
    @users = User.page(params[:page]).per_page(10)
---
SELECT `users`.* FROM `users` LIMIT 10 OFFSET 0