app/views/routes/search.html.erb

SELECT `nodes`.* FROM `nodes` WHERE `nodes`.`name` = 'Ruby'
---
	<%= javascript_tag do %>
		window.nodes = <%= raw Node.search(:category_eq => "District").all.to_json(:include => {:stops => {:only =>[:id, :name, :lat, :lon]}},:only => [:name, :path, :id] ) %>;