app/views/routes/show.html.erb

SELECT `sub_routes`.* FROM `sub_routes` WHERE (`sub_routes`.route_id = 1)
---
	<table class ="table table-striped">
		<% for i in 0..@route.sub_routes.length-1 %>